[LWS_Warden X2SoldierClassTemplate]
+DisplayName="Warden"
+ClassSummary="Wardens are psionically gifted scouts. However, they have not received traditional training in psionics, and the way they use it differs from what we've seen before. Instead of using a Psi Amp to amplify their mind's power, they make their body act as a conduit for the dormant psionic energy around the battlefield. They affect it in various ways as the energy passes through them."
+LeftAbilityTreeTitle="Ebb"
+RightAbilityTreeTitle="Flow"
+AbilityTreeTitles[0]="Ebb"
+AbilityTreeTitles[1]="Tide"
+AbilityTreeTitles[2]="Flow"
+AbilityTreeTitles[3]="XCOM"
+AbilityTreeTitles[4]="Pistols"
;ALPHABETICAL ORDER
+RandomNickNames[0]="Acheron"
+RandomNickNames[1]="Aether"
+RandomNickNames[2]="Arrakis"
+RandomNickNames[3]="Atreides"
+RandomNickNames[4]="Bosporus"
+RandomNickNames[5]="Caldera"
+RandomNickNames[6]="Devil's Current"
+RandomNickNames[7]="Elysian"
+RandomNickNames[8]="Equinox"
+RandomNickNames[9]="Fremen"
+RandomNickNames[10]="Moonspell"
+RandomNickNames[11]="Nova"
+RandomNickNames[12]="Pulsar"
+RandomNickNames[13]="Red River"
+RandomNickNames[14]="Redshift"
+RandomNickNames[15]="Rogue Wave"
+RandomNickNames[16]="Rubicon"
+RandomNickNames[17]="Shepherd"
+RandomNickNames[18]="Tigris"
+RandomNickNames[19]="Wildfire"
+RandomNickNames[20]="Yanartash"
;ALPHABETICAL ORDER
+RandomNickNames_Male[0]="Orion"
;ALPHABETICAL ORDER
+RandomNickNames_Female[0]="Artemis"
;ALPHABETICAL ORDER
+PhotoboothSoloBLines_Male[0]="His blade... THEIR BLOOD!"
+PhotoboothSoloBLines_Male[1]="A Storm is Coming."
+PhotoboothSoloBLines_Male[2]="His blade will bring JUSTICE!"
+PhotoboothSoloBLines_Male[3]="If He Is With Us, Who Can Stand Against Us?"
+PhotoboothSoloBLines_Male[4]="Blademaster. Death Dealer."
+PhotoboothSoloBLines_Male[5]="\"I do not fear the storm.  I am the storm.\""
+PhotoboothSoloBLines_Female[0]="Her blade... THEIR BLOOD!"
+PhotoboothSoloBLines_Female[1]="A Storm is Coming."
+PhotoboothSoloBLines_Female[2]="Her blade will bring JUSTICE!"
+PhotoboothSoloBLines_Female[3]="If She Is With Us, Who Can Stand Against Us?"
+PhotoboothSoloBLines_Female[4]="Blademaster. Death Dealer."
+PhotoboothSoloBLines_Female[5]="\"I do not fear the storm.  I am the storm.\""

[WardenSpacialSurfer X2AbilityTemplate]
LocFriendlyName="Spacial Surfer"
LocLongDescription="Gain the Teleport ability, letting you instantly teleport anywhere within squadsight. You can use Teleport when in either stance."
LocHelpText="Instantly teleport anywhere within squadsight. Available in both stances."
LocFlyOverText="Spacial Surfer"
LocPromotionPopupText="<Bullet/> Teleport does not end the turn when used and has a 3 turn cooldown. You can use Teleport when in either stance."

[WardenRelocate X2AbilityTemplate]
LocFriendlyName="Relocate"
LocLongDescription="Gain the Transposition ability, letting you swap positions with an ally or enemy. You can use Transposition when in either stance."
LocHelpText="Instantly teleport anywhere within squadsight. Available in both stances."
LocFlyOverText="Relocate"
LocPromotionPopupText="<Bullet/> Transposition does not end the turn when used and has a 3 turn cooldown. You can use Transposition when in either stance."